{
  "projects": [
    {
      "title": "Visa Product Design System",
      "role": "Senior Staff Design Engineer",
      "image": {
        "src": "imgs/projects/visa-logo.svg",
        "alt": "Visa logo"
      },
      "color": {
        "background": "rgba(21, 25, 90, 0.87)",
        "foreground": "rgb(221, 221, 221)",
        "role": "#15195a"
      },
      "id": "visa",
      "description": [
        "The Visa Product Design System (VPDS) is an internal design system focused on serving applications with Visa-ready design mocks, design patterns, styles, and components. We've divided VPDS into different tracks to support multiple technologies and methods of consumption. These tracks include Design, Web (HTML + CSS), Angular, React, and Flutter. The project was also set up as an internally open-sourced project, in which many designers and developers across the company could contribute to the design system.",
        "My role on this projects was to lead the Web library, and architect the CSS library. These responsibilities included pixel-perfect styles implemention and enabling easy theming with optional high customization. We also provide documentation with accessible HTML snippets for markup reference and customization guidance. In a way, this worked like an internal bootstrap and tailwind library with responsive behavior and with accessibility (a11y) testing across browsers and screen readers. The styles exported by have more than 290,000 internal installs consumed by server-side rendered applications, AEM sites (like <a href=\"https://developer.visa.com/\" target=\"_blank\">Visa Developer Center</a>) as well as Angular, React, and other Javascript based applications across the company. All our libraries have been installed more than 615,000 times internally across technologies and versions.", 
        "My involvement on the project started since before it was fully chartered, by developing a library of basic components that could be themed, modified, extended, and/or forked to produce other component libraries for multiple projects across Visa. We would provide a default Visa theme, that would then turn into the VPDS design and code libraries. These libraries would also follow Visa's General A11y Guidelines (<a href=\"https://developer.visa.com/pages/accessibility\" target=\"_blank\">VGAR</a>) to ensure our components where usable and accessible across the board."
      ],
      "screenshots": [],
      "videos": [
        "Vu6HRpiGP7Y"
      ],
      "tags": [
        "development",
        "design",
        "open source",
        "community",
        "components",
        "html",
        "css",
        "scss",
        "sass",
        "gulp",
        "npm",
        "node",
        "lint",
        "eslint",
        "prettier",
        "browser-sync",
        "architecture",
        "layouts",
        "axe",
        "a11y",
        "accessibility",
        "themes",
        "white label",
        "project management",
        "agile",
        "ux",
        "ui",
        "user interface",
        "user experience",
        "styleguide",
        "documentation",
        "pixel perfect",
        "design implementation"
      ]
    },
    {
      "title": "gulp-axe-cli",
      "role": "developer / maintainer",
      "image": {
        "src": "imgs/projects/gulpaxe-logo.png",
        "alt": "gulp-axe-cli project accessibility icon"
      },
      "color": {
        "background": "rgba(2, 52, 72, 0.85)",
        "foreground": "rgb(221, 221, 221)",
        "role": "#023448"
      },
      "id": "gulpaxe",
      "description": [
        "Other axe-based plugins are built to generate reports. While these reports are great for analysis, these CLIs, plugins, and packages do not always work well with development pipelines. With gulp-axe-cli, we leverage the power of gulp as a task runner 💪 and the automation for a11y testing of aXe 💥 to prevent bad code from being committed or built. 👍"
      ],
      "links": [
        {
          "label": "npm package",
          "href": "https://www.npmjs.com/package/gulp-axe-cli"
        },
        {
          "label": "github repo",
          "href": "https://github.com/samueleishion/gulp-axe-cli"
        }
      ],
      "code": [
        "$ npm install --save-dev gulp-axe-cli"
      ],
      "screenshots": [],
      "tags": [
        "gulp",
        "axe",
        "a11y",
        "accessibility",
        "testing",
        "automation",
        "cli",
        "ci",
        "cd",
        "continuous integration",
        "continuous development",
        "open source",
        "plugin"
      ]
    },
    {
      "title": "Perspective",
      "role": "Co-Founder & CTO",
      "image": {
        "src": "imgs/projects/perspective-logo.svg",
        "alt": "Perspective logo"
      },
      "color": {
        "background": "rgba(34, 34, 34, 0.85)",
        "foreground": "rgb(221, 221, 221)",
        "role": "#d21d33"
      },
      "id": "perspective",
      "description": [
        "<a href=\"https://perspectiveux.com/\" target=\"_blank\">Perspective</a> is a company and a product which focuses on tracking and analyzing real time customer reactions to your application. Our customers would create a survey and each question would be triggered and displayed to the user after they performed an action. This would allow the questions to be contextual (relative to the context of the action the user had performed), thus providing a less intrusive user experience by limiting distractions, and improving response rates. All of this aggregated data resulted in visualizations with statistical analysis that would help you understand your users better, finding patterns in their collective responses.",
        "My role was to oversee the development of all the technologies that made Perspective operational, including the marketing site, the plugin for client's apps, the dashboard front-end application, and the API & database updates. I would also oversee visual, application, and UX design, as well as the research and development of our data analytics and visualization.",
        "My involvement on the project when my co-founder and I realized the need for a product like this. We built multiple prototypes, tested them, gathered feedback and market validation, and adapted our project to build our alphas and final beta application.",
        "Perspective is for sale. Interesting in buying or bidding? <br /><a href=\"https://flippa.com/10565338-saas-internet\" target=\"_blank\">Check out our listing on flippa.com</a>"
      ],
      "screenshots": [
        {
          "src": "imgs/projects/perspective-site-1.png",
          "alt": "Perspective's homepage screenshot"
        },
        {
          "src": "imgs/projects/perspective-site-2.png",
          "alt": "Perspective plugin sample"
        },
        {
          "src": "imgs/projects/perspective-site-3.png",
          "alt": "Perspective's dashboard screenshot"
        }
      ],
      "tags": [
        "business",
        "entrpreneurship",
        "startup",
        "development",
        "application",
        "components",
        "html",
        "css",
        "scss",
        "sass",
        "javascript",
        "js",
        "react",
        "stenciljs",
        "metalsmith",
        "express",
        "java",
        "heroku",
        "digital ocean",
        "gulp",
        "npm",
        "node",
        "browser-sync",
        "architecture",
        "project management",
        "agile",
        "ux",
        "ui",
        "cx",
        "user interface",
        "user experience",
        "customer experience",
        "feedback",
        "research",
        "survey",
        "data science",
        "natural language processing",
        "nlp",
        "data visualization",
        "design",
        "sketch",
        "invision"
      ]
    },
    {
      "title": "stockbot",
      "role": "developer / maintainer",
      "image": {
        "src": "imgs/projects/robinhood-logo.png",
        "alt": "Robinhood logo - the trading platform for stockbot"
      },
      "color": {
        "background": "rgba(4, 13, 20, 0.85)",
        "foreground": "rgb(221, 221, 221)",
        "role": "#22a87d"
      },
      "id": "stockbot",
      "description": [
        "As the name implies, this is a bot to automate stock trading. This bot analyzes current market status, evaluates individual performing stocks, and determines when to buy/sell stocks.",
        "Currently, this bot uses several data science, applied statistics, and applied probability techniques to evaluate stock performance and predict outcome based on a set of parameters. These techniquest have been derived from my Machine Learning and Natural Language Processing CS courses."
      ],
      "screenshots": [],
      "tags": [
        "stocks",
        "bots",
        "automation",
        "statistics",
        "probability",
        "bayes",
        "bayesian",
        "machine learning",
        "natural language processing",
        "ml",
        "nlp",
        "ngrams",
        "linear regression",
        "data science"
      ]
    }
  ]
}
